# BuilidingPadStructureIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BuilidingPadStructureIdParam Property
ParameterTypeId Class See Also
---
"Structure"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BuilidingPadStructureIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuilidingPadStructureIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BuilidingPadStructureIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace